app/controllers/categories_controller.rb

DELETE FROM "categories" WHERE "id" = 5
SELECT * FROM "categories" WHERE ("categories"."id" = E'5') LIMIT 1
---
  def destroy
    Category.find_by_id(params[:id]).destroy;