app/controllers/tasks_controller.rb

SELECT * FROM "tasks" ORDER BY till
---
  def index
    @tasks = Task.all(:order => 'till')

SELECT * FROM "tasks" WHERE ("tasks"."id" = E'33') LIMIT 1
---
  def show
    @task = Task.find_by_id(params[:id])

SELECT * FROM "categories"
---
  def new
    @task = Task.new
    @categories = Category.all

INSERT INTO "tasks" ("name", "till", "created_at", "priority_id", "updated_at", "done", "user_id", "category_id", "description") VALUES(E'aaaaaaaaa', '2010-03-28', '2010-03-28 12:12:44.213232', NULL, '2010-03-28 12:12:44.213232', NULL, NULL, 5, E'asdsad') RETURNING "id"
SELECT * FROM "tasks"
---
    task = params[:task]
    @task = Task.new(task)

    @task.save
    @tasks = Task.all

SELECT * FROM "tasks" WHERE ("tasks"."id" = E'39') LIMIT 1
SELECT * FROM "categories"
---
  def edit
    @task = Task.find_by_id(params[:id])
    @categories = Category.all

SELECT * FROM "tasks" WHERE ("tasks"."id" = E'42') LIMIT 1
UPDATE "tasks" SET "updated_at" = '2010-03-29 17:31:46.183333', "till" = '2010-05-29' WHERE "id" = 43
SELECT * FROM "tasks"
---
    task = params[:task]
    return :text => '' if params[:commit].eql?('Cancel')
    @task = Task.find_by_id(params[:id])
    @task.update_attributes(task)
    @tasks = Task.all

DELETE FROM "tasks" WHERE "id" = 34
SELECT * FROM "tasks" WHERE ("tasks"."id" = E'34') LIMIT 1
---
  def destroy
    Task.find_by_id(params[:id]).destroy;